app/Http/Controllers/CommentController.php

insert into `comments` (`post_id`, `body`, `updated_at`, `created_at`) values (5, 'aaa', '2021-06-14 15:40:32', '2021-06-14 15:40:32')
---
    public function store(Request $request, Post $post)
    {
        // バリデーション   本文が未入力の場合、もとの画面に差し戻してくれる
        $request->validate([
            'body' => 'required',
        ]);

        // commentモデルのインスタンスを作る
        $comment = new Comment();

        $comment->post_id = $post->id;
        // リクエストで渡ってきたbodyを代入
        $comment->body = $request->body;
        $comment->save();