app/Http/Controllers/PostController.php

    public function index()
    {
        // Postsテーブルの全てのレコードを取得する
        // $posts = Post::all();

        // Postsテーブルの値を全て取得し、order BYでソートする ※以下2つは同じ意味 下が短くかける
        // $posts = Post::orderBy('created_at', 'desc')->get();
        $posts = Post::latest()->get();
---
select * from `posts` order by `created_at` desc

    public function store(PostRequest $request)
    {
        // PostRequestを使用せずにコントローラー内でバリデーションを行いたいなら以下を記述する
        // $request->validate([
        //     'title' => 'required|min:3',
        //     'body' => 'required',
        // ], [
        //     'title.required' => 'タイトルは必須です',
        //     'title.min' => ':min 文字以上入力してください',
        //     'body.required' => '本文は必須です',
        // ]);

        // Postモデル（クラス）をインスタンス化       ※Implicit bindingで引数$postが渡ってきていないため、Postのインスタンス化が必要
        $post = new Post();

        // postされたタイトルを代入
        $post->title = $request->title;

        // postされた本文をを代入
        $post->body = $request->body;

        // レコードをINSERTする
        $post->save();
---
insert into `posts` (`title`, `body`, `updated_at`, `created_at`) values ('aaa', 'gg', '2021-07-25 16:34:04', '2021-07-25 16:34:04')

    public function search(Request $request)
    {
        // postされた検索ワードを取得
        $search_title = $request->input('search_title');

        // 検索ワードに該当するレコードを全て取得する
        $posts = DB::table('posts')
            ->where('title', 'like', '%' . $search_title . '%')
            ->latest()
            ->get();

        return view('index')
            ->with(['posts' => $posts]);
---
select * from `posts` where `title` like '%aaa%' order by `created_at` desc
select * from `posts` order by `created_at` desc